#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <pthread.h>

#include "make_log.h"

int main(int argc, char *argv[])
{
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);
    LOG("1111", "222", "%s ,%d", "123123", 100);

    //将某个文件 存到fastDFS 分布式存储服务器中






	return 0;
}
